# Inserting Data

### The Syntax

In [1]:
INSERT INTO table [(column, …)]
VALUES (value, …), (…), …;

ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near 'table [(column, …)] VALUES (value, …), (…), …' at line 1

In [5]:
INSERT INTO test.books
VALUES('The Big Sleep', 'Raymond Chandler', '1934');

ERROR 1366 (22007): Incorrect integer value: 'The Big Sleep' for column `test`.`books`.`book_id` at row 1

In [6]:
INSERT INTO books
VALUES('The Thirty-Nine Steps', 'John Buchan', DEFAULT);

ERROR 1046 (3D000): No database selected

In [7]:
INSERT INTO books
(author, title)
VALUES('Evelyn Waugh','Brideshead Revisited');

ERROR 1046 (3D000): No database selected

In [8]:
INSERT INTO books
(title, author, year)
VALUES('Visitation of Spirits','Randall Kenan','1989'),
('Heart of Darkness','Joseph Conrad','1902'),
('The Idiot','Fyodor Dostoevsky','1871');

ERROR 1046 (3D000): No database selected

### Practical Examples

In [9]:
USE rookery;

In [10]:
DESCRIBE bird_orders;

In [11]:
ALTER TABLE bird_orders
AUTO_INCREMENT = 100;

In [12]:
INSERT INTO bird_orders (scientific_name, brief_description)
VALUES('Anseriformes', "Waterfowl"),
('Galliformes', "Fowl"),
('Charadriiformes', "Gulls, Button Quails, Plovers"),
('Gaviiformes', "Loons"),
('Podicipediformes', "Grebes"),
('Procellariiformes', "Albatrosses, Petrels"),
('Sphenisciformes', "Penguins"),
('Pelecaniformes', "Pelicans"),
('Phaethontiformes', "Tropicbirds"),
('Ciconiiformes', "Storks"),
('Cathartiformes', "New-World Vultures"),
('Phoenicopteriformes', "Flamingos"),
('Falconiformes', "Falcons, Eagles, Hawks"),
('Gruiformes', "Cranes"),
('Pteroclidiformes', "Sandgrouse"),
('Columbiformes', "Doves and Pigeons"),
('Psittaciformes', "Parrots"),
('Cuculiformes', "Cuckoos and Turacos"),
('Opisthocomiformes', "Hoatzin"),
('Strigiformes', "Owls"),
('Struthioniformes', "Ostriches, Emus, Kiwis"),
('Tinamiformes', "Tinamous"),
('Caprimulgiformes', "Nightjars"),
('Apodiformes', "Swifts and Hummingbirds"),
('Coraciiformes', "Kingfishers"),
('Piciformes', "Woodpeckers"),
('Trogoniformes', "Trogons"),
('Coliiformes', "Mousebirds"),
('Passeriformes', "Passerines");

### The Table for Bird Families

In [13]:
DESCRIBE bird_families;
SELECT order_id FROM bird_orders
WHERE scientific_name = 'Gaviiformes';

In [14]:
INSERT INTO bird_families
VALUES(100, 'Gaviidae',
"Loons or divers are aquatic birds found mainly in the Northern Hemisphere.",
103);

In [15]:
INSERT INTO bird_families
VALUES('Anatidae', "This family includes ducks, geese and swans.", NULL, 103);

ERROR 1366 (22007): Incorrect integer value: 'Anatidae' for column `rookery`.`bird_families`.`family_id` at row 1

In [16]:
SHOW WARNINGS;

In [17]:
SELECT * FROM bird_families;

In [19]:
DELETE FROM bird_families
WHERE family_id = 101;

In [20]:
INSERT INTO bird_families
(scientific_name, order_id, brief_description)
VALUES('Anatidae', 103, "This family includes ducks, geese and swans.");

In [21]:
SELECT * FROM bird_families;

In [22]:
SELECT order_id, scientific_name FROM bird_orders;

In [23]:
INSERT INTO bird_families
(scientific_name, order_id)
VALUES('Charadriidae', 109),
('Laridae', 102),
('Sternidae', 102),
('Caprimulgidae', 122),
('Sittidae', 128),
('Picidae', 125),
('Accipitridae', 112),
('Tyrannidae', 128),
('Formicariidae', 128),
('Laniidae', 128);

In [24]:
SELECT family_id, scientific_name
FROM bird_families
ORDER BY scientific_name;

In [28]:
SHOW COLUMNS FROM birds;

In [27]:
SHOW COLUMNS FROM birds LIKE '%id';

### The Table for Birds

In [29]:
INSERT INTO birds
(common_name, scientific_name, family_id)
VALUES('Mountain Plover', 'Charadrius montanus', 103);

In [30]:
INSERT INTO birds
(common_name, scientific_name, family_id)
VALUES('Snowy Plover', 'Charadrius alexandrinus', 103),
('Black-bellied Plover', 'Pluvialis squatarola', 103),
('Pacific Golden Plover', 'Pluvialis fulva', 103);

In [31]:
SELECT common_name AS 'Bird',
birds.scientific_name AS 'Scientific Name',
bird_families.scientific_name AS 'Family',
bird_orders.scientific_name AS 'Order'
FROM birds,
bird_families,
bird_orders
WHERE birds.family_id = bird_families.family_id
AND bird_families.order_id = bird_orders.order_id;

### Inserting Emphatically

In [32]:
INSERT INTO bird_families
SET scientific_name = 'Rallidae',
order_id = 113;

### Inserting Data from Another Table

In [34]:
DESCRIBE cornell_birds_families_orders;

ERROR 1146 (42S02): Table 'rookery.cornell_birds_families_orders' doesn't exist

In [35]:
SELECT * FROM cornell_birds_families_orders
LIMIT 1;

ERROR 1146 (42S02): Table 'rookery.cornell_birds_families_orders' doesn't exist

In [36]:
ALTER TABLE bird_families
ADD COLUMN cornell_bird_order VARCHAR(255);

In [37]:
ALTER TABLE bird_families
ADD COLUMN cornell_bird_order VARCHAR(255);

ERROR 1060 (42S21): Duplicate column name 'cornell_bird_order'

In [38]:
INSERT IGNORE INTO bird_families
(scientific_name, brief_description, cornell_bird_order)
SELECT bird_family, examples, bird_order
FROM cornell_birds_families_orders;

ERROR 1146 (42S02): Table 'rookery.cornell_birds_families_orders' doesn't exist

In [39]:
SELECT * FROM bird_families
ORDER BY family_id DESC LIMIT 1;

### A Digression: Setting the Right ID

In [40]:
SELECT DISTINCT bird_orders.order_id,
cornell_bird_order AS "Cornell's Order",
bird_orders.scientific_name AS 'My Order'
FROM bird_families, bird_orders
WHERE bird_families.order_id IS NULL
AND cornell_bird_order = bird_orders.scientific_name
LIMIT 5;

In [41]:
UPDATE bird_families, bird_orders
SET bird_families.order_id = bird_orders.order_id
WHERE bird_families.order_id IS NULL
AND cornell_bird_order = bird_orders.scientific_name;

In [42]:
SELECT * FROM bird_families
ORDER BY family_id DESC LIMIT 4;

In [43]:
SELECT * FROM bird_orders
WHERE order_id = 128;

In [44]:
SELECT family_id, scientific_name, brief_description
FROM bird_families
WHERE order_id IS NULL;

In [45]:
UPDATE bird_families
SET order_id = 112
WHERE cornell_bird_order = 'Accipitriformes';

In [46]:
ALTER TABLE bird_families
DROP COLUMN cornell_bird_order;
DROP TABLE cornell_birds_families_orders;

ERROR 1051 (42S02): Unknown table 'rookery.cornell_birds_families_orders'

### Replacing Data

In [47]:
REPLACE INTO bird_families
(scientific_name, brief_description, order_id)
VALUES('Viduidae', 'Indigobirds & Whydahs', 128),
('Estrildidae', 'Waxbills, Weaver Finches, & Allies', 128),
('Ploceidae', 'Weavers, Malimbe, & Bishops', 128);

In [48]:
SELECT * FROM bird_families
WHERE scientific_name = 'Viduidae';

### Priorities When Inserting Data

In [51]:
INSERT LOW_PRIORITY INTO bird_sightings;

ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near '' at line 1

### Summary

At this point, you should have a good understanding of MySQL and MariaDB. You
should understand the basic structure of a database and its tables. You should now see
the value of having smaller multiple tables. You should no longer envision a database
as one large table or like a spreadsheet. You should have a good sense of columns and
how to enter data into them, especially if you have done all of the exercises at the end
of the previous two chapters. You should not be overwhelmed at this point.
Chapter 7 delves more deeply into how to retrieve data from tables using the SELECT
statement. We have already touched on this SQL statement several times. However, you
saw only a sampling of how you might use SELECT in this chapter and in previous ones, to give you a sense of why we were creating and adding data the way we did to tables.
The next chapter will cover the SELECT statement in much more detail.
The INSERT, SELECT, and the UPDATE statements are the most used SQL statements. If
you want to learn MySQL and MariaDB well, you need to know these statements well.
You need to know how to do the basics, as well as be familiar with the more specialized
aspects of using SELECT. You’ll accomplish that in the next chapter.
Before moving on to the next chapter, though, complete the following exercises. They
will help you to retain what you’ve learned about the INSERT statement in this chapter.
Don’t skip them. This is useful and necessary to building a solid foundation in learning
MySQL and MariaDB.